---
kind: type
id: T:Autodesk.Revit.DB.OverrideGraphicSettings
source: html/eb2bd6b6-b7b2-5452-2070-2dbadb9e068a.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings

Settings to override display of elements in a view.

## Syntax (C#)
```csharp
public class OverrideGraphicSettings : IDisposable
```